In [1]:
import sqlite3

In [2]:
db = sqlite3.connect("practice_sql.db")
cur = db.cursor()

In [3]:
cur.execute("CREATE TABLE student (id int primary key,name text, marks int)")

In [4]:
cur.execute("INSERT INTO student (id,name,marks) values (1,'john',85)")

In [5]:
cur.execute("INSERT INTO student (id,name,marks) values (2,'steve',90),(3,'elon',100)")

In [6]:
cur.execute("INSERT INTO student values (4,'jeff',99)")

In [7]:
print(cur.rowcount,"rows inserted")

1 rows inserted

In [8]:
db.commit;

In [9]:
print(cur.rowcount,"rows inserted")

1 rows inserted

In [10]:
results = cur.execute("select * from student")
for row in results:
    print(row)

(1, 'john', 85)
(2, 'steve', 90)
(3, 'elon', 100)
(4, 'jeff', 99)

In [15]:
db1 = sqlite3.connect('practice_sqll.db')

In [16]:
cur1 = db1.cursor()

In [17]:
cur1.execute("create table employee (id int,name text,age int)")

In [19]:
cur1.execute("insert into employee values (1,'dom',45),(2,'jeff',40)")

In [22]:
cur1.execute("insert into employee values (3,'slava',46),(4,'dairamuid',48)")

In [23]:
db1.commit;

In [25]:
results = cur1.execute("select * from employee")
for row in results:
    print(row)

(1, 'dom', 45)
(2, 'jeff', 40)
(3, 'slava', 46)
(4, 'dairamuid', 48)

# ACCESSING DATA STORED IN DB

In [26]:
#if we wav only particular coulms data
result = cur1.execute("select id,name from employee")
result.fetchall()

[(1, 'dom'), (2, 'jeff'), (3, 'slava'), (4, 'dairamuid')]

In [27]:
result = cur1.execute("select name,age from employee")
result.fetchall()

[('dom', 45), ('jeff', 40), ('slava', 46), ('dairamuid', 48)]

In [29]:
dat=cur1.execute("select * from employee where name='slava'")
dat.fetchall()

[(3, 'slava', 46)]

In [30]:
dat=cur1.execute("select * from employee where id=1")
dat.fetchall()

[(1, 'dom', 45)]

In [38]:
dat=cur1.execute("select * from employee where id=2")
dat.fetchall()

[(2, 'jeff', 40)]

In [39]:
dat=cur1.execute("select name from employee where id=3")
dat.fetchall()

[('slava',)]

In [40]:
dat=cur1.execute("select age from employee where id=3")
dat.fetchall()

[(46,)]

In [41]:
dat=cur1.execute("select * from employee where age>45 and age<47")
dat.fetchall()

[(3, 'slava', 46)]

In [56]:
dat=cur1.execute("select * from employee where name='slava' and age=46")
dat.fetchall()

[(3, 'slava', 46)]

In [58]:
dat=cur1.execute("select * from employee where name='slava' or age=100")
dat.fetchall()

[(3, 'slava', 46)]

In [59]:
dat=cur1.execute("select * from employee where name='slava' or age=40")
dat.fetchall()

[(2, 'jeff', 40), (3, 'slava', 46)]

# order by clause

In [42]:
dat=cur1.execute("select * from employee order by name asc")
dat.fetchall()

[(4, 'dairamuid', 48), (1, 'dom', 45), (2, 'jeff', 40), (3, 'slava', 46)]

In [43]:
dat=cur1.execute("select * from employee order by id asc")
dat.fetchall()

[(1, 'dom', 45), (2, 'jeff', 40), (3, 'slava', 46), (4, 'dairamuid', 48)]

In [46]:
dat=cur1.execute("select * from employee order by name desc")
dat.fetchall()

[(3, 'slava', 46), (2, 'jeff', 40), (1, 'dom', 45), (4, 'dairamuid', 48)]

# keywords

In [60]:
dat=cur1.execute("select max(age) from employee")
dat.fetchall()

[(48,)]

In [61]:
dat=cur1.execute("select min(age) from employee")
dat.fetchall()

[(40,)]

In [62]:
dat=cur1.execute("select avg(age) from employee")
dat.fetchall()

[(44.75,)]

In [63]:
dat=cur1.execute("select count(id) from employee")
dat.fetchall()

[(4,)]

In [65]:
dat=cur1.execute("select * from employee where age between 45 and 49")
dat.fetchall()

[(1, 'dom', 45), (3, 'slava', 46), (4, 'dairamuid', 48)]

In [66]:
dat=cur1.execute("select * from employee where age is not null")
dat.fetchall()

[(1, 'dom', 45), (2, 'jeff', 40), (3, 'slava', 46), (4, 'dairamuid', 48)]

In [67]:
dat=cur1.execute("select * from employee where age is null")
dat.fetchall()

[]

In [68]:
dat=cur1.execute("select * from employee where name like 'd%'")
dat.fetchall()

[(1, 'dom', 45), (4, 'dairamuid', 48)]

In [69]:
dat=cur1.execute("select * from employee where name like '%d'")
dat.fetchall()

[(4, 'dairamuid', 48)]

In [72]:
dat=cur1.execute("select * from employee where name like '__i%'")
dat.fetchall()

[(4, 'dairamuid', 48)]

In [75]:
dat=cur1.execute("select * from employee where name like '%a%'")
dat.fetchall()

[(3, 'slava', 46), (4, 'dairamuid', 48)]

In [76]:
dat=cur1.execute("select * from employee where age NOT in (50)")
dat.fetchall()

[(1, 'dom', 45), (2, 'jeff', 40), (3, 'slava', 46), (4, 'dairamuid', 48)]

In [77]:
dat=cur1.execute("select * from employee where name NOT in ('dom')")
dat.fetchall()

[(2, 'jeff', 40), (3, 'slava', 46), (4, 'dairamuid', 48)]

In [78]:
results = cur1.execute("select * from employee")
for row in results:
    print(row)

(1, 'dom', 45)
(2, 'jeff', 40)
(3, 'slava', 46)
(4, 'dairamuid', 48)

# UPDATING RECORD

In [79]:
#UPDATING RECORD
sql = "update employee set age=46 where id=1"
cur1.execute(sql)

In [80]:
results = cur1.execute("select * from employee")
for row in results:
    print(row)

(1, 'dom', 46)
(2, 'jeff', 40)
(3, 'slava', 46)
(4, 'dairamuid', 48)

In [81]:
#updating multiple records
sql = "update employee set age=35 where id in (1,2)"
cur1.execute(sql)

In [82]:
results = cur1.execute("select * from employee")
for row in results:
    print(row)

(1, 'dom', 35)
(2, 'jeff', 35)
(3, 'slava', 46)
(4, 'dairamuid', 48)

# DELETING RECORDS

In [83]:
sql="delete from employee where id = 1"
cur1.execute(sql)

In [84]:
results = cur1.execute("select * from employee")
for row in results:
    print(row)

(2, 'jeff', 35)
(3, 'slava', 46)
(4, 'dairamuid', 48)

# DROP TABLE

In [85]:
sql = 'drop table employee'
cur1.execute(sql)

In [86]:
results = cur1.execute("select * from employee")
for row in results:
    print(row)

OperationalError: no such table: employee

In [87]:
db.close()

In [88]:
db1.close()